Revit 2027 API
ExtensibleStorageFilter Class
 A filter used to filter elements with extensible storage data based on specific Schema id.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.ExtensibleStorage.ExtensibleStorageFilter
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ExtensibleStorageFilter : ElementQuickFilter
Public Class ExtensibleStorageFilter
	Inherits ElementQuickFilter
public ref class ExtensibleStorageFilter : public ElementQuickFilter
type ExtensibleStorageFilter =
    class
        inherit ElementQuickFilter
    end
The ExtensibleStorageFilter type exposes the following members.
Constructors
Name | Description
ExtensibleStorageFilter |  Constructs a new instance of a filter to match elements with extensible storage data based on specific Schema id.
Top
Properties
Name | Description
Inverted |  True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
(Inherited from ElementFilter)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ElementFilter)
SchemaGuid |  Schema id used to filter elements with extensible storage data
Top
Methods
Name | Description
Dispose
(Inherited from ElementFilter)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
PassesFilter(Element) |  Applies the filter to a given element.
(Inherited from ElementFilter)
PassesFilter(Document, ElementId) |  Applies the filter to a given element.
(Inherited from ElementFilter)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.
See Also
Reference
Autodesk.Revit.DB.ExtensibleStorage Namespace